#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.AmazonEKSClusterAssumeRolePolicy: Reading...
aws_eip.eip_01: Refreshing state... [id=eipalloc-09318f66ce096ff8f]
aws_vpc.vpc: Refreshing state... [id=vpc-0f4f6ed9ba632f547]
aws_iam_policy.AWSLoadBalancerControllerIAMPolicy: Refreshing state... [id=arn:aws:iam::318374019075:policy/earth-dev-AWSLoadBalancerControllerIAMPolicy]
aws_iam_policy.AmazonEKSS3CSIDriverPolicy: Refreshing state... [id=arn:aws:iam::318374019075:policy/earth-dev-AmazonEKSS3CSIDriverPolicy]
data.aws_iam_policy_document.AmazonEKSClusterAssumeRolePolicy: Read complete after 0s [id=3552664922]
aws_iam_role.AmazonEKSNodeGroupRole: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole]
aws_eip.eip_02: Refreshing state... [id=eipalloc-0486ff4abade1232a]
aws_iam_role.AmazonEKSClusterRole: Refreshing state... [id=earth-dev-AmazonEKSClusterRole]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole-20231213091742992500000004]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole-20231213091742974000000003]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-AmazonEKSClusterRole-20231213091742925700000001]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-AmazonEKSClusterRole-20231213091742934600000002]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0a7f4683f213cec8a]
aws_security_group.cluster_sg: Refreshing state... [id=sg-05875fd4f23c4cb8f]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-06ec324d5ae7bbe89]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-0e9b8cf73d6252f66]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-0fbe10a44dc88ddf9]
aws_security_group.allnodes-sg: Refreshing state... [id=sg-0dd122d336afc7152]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-0bb41f45e499fbbfe]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0e932ca6709dd7ac9]
aws_eks_cluster.eks_cluster: Refreshing state... [id=earth-dev]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-072dfa5855de2d684]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-0bd87fe0844675a04]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-0ccd5831c24a7476a]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-0621e85dd53edeca4]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-05df84a4e6b769e88]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-0c0d6fc43213dc096]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-0221b440b5b9762d7]
aws_eks_identity_provider_config.oidc: Refreshing state... [id=earth-dev:earth-dev]
aws_eks_addon.kube_proxy: Refreshing state... [id=earth-dev:kube-proxy]
data.tls_certificate.eks_cluster: Reading...
aws_eks_addon.vpc_cni: Refreshing state... [id=earth-dev:vpc-cni]
aws_launch_template.app_node: Refreshing state... [id=lt-0a7a52f3feac68d1f]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-00ad27c2d7327f3b4]
aws_eks_node_group.app_node_group: Refreshing state... [id=earth-dev:app-node-group]
data.tls_certificate.eks_cluster: Read complete after 0s [id=d516f34410b983ad338645e4e1cb5bbfcdf5079b]
aws_iam_openid_connect_provider.eks_cluster: Refreshing state... [id=arn:aws:iam::318374019075:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/07ECE58AD206F4A9D83614C1FCBF433A]
data.aws_iam_policy_document.AmazonEKSS3CSIDriverAssumeRolePolicy: Reading...
data.aws_iam_policy_document.AmazonEKSVPCCNIAssumeRolePolicy: Reading...
data.aws_iam_policy_document.AmazonEKSLoadBalancerControllerAssumeRolePolicy: Reading...
data.aws_iam_policy_document.AmazonEKSEBSCSIDriverAssumeRolePolicy: Reading...
data.aws_iam_policy_document.AmazonEKSS3CSIDriverAssumeRolePolicy: Read complete after 0s [id=39831165]
data.aws_iam_policy_document.AmazonEKSVPCCNIAssumeRolePolicy: Read complete after 0s [id=2196906219]
data.aws_iam_policy_document.AmazonEKSLoadBalancerControllerAssumeRolePolicy: Read complete after 0s [id=288759010]
data.aws_iam_policy_document.AmazonEKSEBSCSIDriverAssumeRolePolicy: Read complete after 0s [id=2855273071]
aws_iam_role.AmazonEKSS3CSIDriverRole: Refreshing state... [id=earth-dev-AmazonEKSS3CSIDriverRole]
aws_iam_role.AmazonEKSVPCCNIRole: Refreshing state... [id=earth-dev-AmazonEKSVPCCNIRole]
aws_iam_role.AmazonEKSLoadBalancerControllerRole: Refreshing state... [id=earth-dev-AmazonEKSLoadBalancerControllerRole]
aws_iam_role.AmazonEKSEBSCSIDriverRole: Refreshing state... [id=earth-dev-AmazonEKSEBSCSIDriverRole]
aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy: Refreshing state... [id=earth-dev-AmazonEKSEBSCSIDriverRole-2023121309244826050000000d]
aws_iam_role_policy_attachment.AWSLoadBalancerControllerIAMPolicy: Refreshing state... [id=earth-dev-AmazonEKSLoadBalancerControllerRole-2023121309244834090000000e]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=earth-dev-AmazonEKSVPCCNIRole-20231213092448676600000011]
aws_iam_role_policy_attachment.AmazonEKSS3CSIDriverPolicy: Refreshing state... [id=earth-dev-AmazonEKSS3CSIDriverRole-2023121309244834730000000f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_addon.aws-mountpoint-s3-csi-driver will be created
  + resource "aws_eks_addon" "aws-mountpoint-s3-csi-driver" {
      + addon_name           = "aws-mountpoint-s3-csi-driver"
      + addon_version        = "v1.1.0-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "earth-dev"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
    }

  # aws_eks_addon.aws_ebs_csi_driver will be created
  + resource "aws_eks_addon" "aws_ebs_csi_driver" {
      + addon_name           = "aws-ebs-csi-driver"
      + addon_version        = "v1.25.0-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "earth-dev"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
    }

  # aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name           = "coredns"
      + addon_version        = "v1.10.1-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "earth-dev"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*